app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 21 LIMIT 1
---
  def show
    @users = User.find_by_id(params[:id])

INSERT INTO `users` (`email`, `name`, `password`) VALUES ('fsfas@mail.com', 'dds', 'e10adc3949ba59abbe56e057f20f883e')
---
  def new
      if request.post?
        @error = nil
        @users = User.create(params.require(:user).permit(:name,:email,:password,:password_confirmation))

SELECT `users`.* FROM `users` WHERE `users`.`id` = 42
---
  def edit
    @users = User.find(:all, :conditions => { :id => params[:id] })